# Python and databases

### install the mysql 8.0 connector:
`pip install PyMySQL`
For more background on the connector/driver [go here](https://o7planning.org/en/11463/connecting-mysql-database-in-python-using-pymysql) and to [the docs](https://pymysql.readthedocs.io/en/latest/modules/cursors.html)

In [9]:

import datetime
import pymysql

cnx = pymysql.connect(user='dev', password='ax2',host='127.0.0.1',port=3307,db='test')  

cursor = cnx.cursor()

query = ("SELECT firstname, lastname, startdate, enddate, salary FROM pythondemo WHERE startdate BETWEEN %s AND %s")

hire_start = datetime.date(1960, 1, 1)
hire_end = datetime.date(2004, 12, 31)

cursor.execute(query, (hire_start, hire_end))

for (firstname, lastname, startdate, enddate, salary) in cursor:
    print("{} {} hired from {} to {} is paid: {} DKR pr month".format(firstname, lastname, startdate, enddate, salary))
print('See what we send to mysql: ',cursor._last_executed)
cursor.close()
cnx.close()

Henny Petersen hired from 2002-02-02 00:00:00 to 2002-02-03 23:00:00 is paid: 23000 DKR pr month
Hanne Hansen hired from 2002-04-03 00:00:00 to None is paid: 94446 DKR pr month
Jesper Fårekylling hired from 2002-04-03 00:00:00 to 2018-07-06 22:00:00 is paid: 23000 DKR pr month
aa bb hired from 2003-04-04 00:00:00 to 2003-05-05 00:00:00 is paid: 31400 DKR pr month
Helga Juhlborg hired from 2003-01-17 00:00:00 to 2004-04-11 00:00:00 is paid: 34100 DKR pr month
Helga Juhlborg hired from 2003-01-17 00:00:00 to 2004-04-11 00:00:00 is paid: 34100 DKR pr month
Helga Juhlborg hired from 2003-01-17 00:00:00 to 2004-04-11 00:00:00 is paid: 34100 DKR pr month
Ulrik Volborg hired from 2003-03-03 00:00:00 to 2005-08-20 00:00:00 is paid: 21000 DKR pr month
Ulla Willman hired from 2001-05-04 00:00:00 to 2005-12-24 00:00:00 is paid: 32000 DKR pr month
Ulfred Valberg hired from 2001-01-04 00:00:00 to 2006-10-30 00:00:00 is paid: 43000 DKR pr month
See what we send to mysql:  SELECT firstname, lastname, startdate, enddate, salary FROM pythondemo WHERE startdate BETWEEN '1960-01-01' AND '2004-12-31'

## Class exercise Select
1. choose a database and a table with content from your mysql server (running on vagrant)
2. using pymysql from a jupyter notebook read and print the content of the table

In [2]:
# insert, update, delete
from __future__ import print_function

from decimal import Decimal
from datetime import datetime, date, timedelta

# Connect with the MySQL Server
cnx = pymysql.connect(user='dev', password='ax2',host='127.0.0.1',port=3307,db='test')  
cursor = cnx.cursor()

curA = cnx.cursor()
curB = cnx.cursor()

# Query to get employees who joined in a period defined by two dates
query = ("SELECT id, salary FROM pythondemo WHERE enddate IS NULL")

# UPDATE and INSERT statements for the old and new salary
update_old_salary = (
  "UPDATE pythondemo SET salary = %s "
  "WHERE id = %s")

# Select the employees getting a raise (all that are still employed)
curA.execute(query)

# Iterate through the result of curA
for (id, salary) in curA:
  # Update the old and insert the new salary
  new_salary = int(round(Decimal(salary) * Decimal('1.15')))
  curB.execute(update_old_salary, (new_salary, id))
  # Commit the changes
  cnx.commit()
cursor.close()
curA.close()
curB.close()
cnx.close()

In [3]:
# with the build in dict cursor
cnx = pymysql.connect(user='dev', password='ax2',host='127.0.0.1',port=3307,db='test') 

cursor = cnx.cursor(pymysql.cursors.DictCursor) 

query = ("SELECT firstname, lastname, startdate, enddate, salary FROM pythondemo")

cursor.execute(query)
cursor.fetchall()

[{'firstname': 'Henny',
  'lastname': 'Petersen',
  'startdate': datetime.datetime(2002, 2, 2, 0, 0),
  'enddate': datetime.datetime(2002, 2, 3, 23, 0),
  'salary': '23000'},
 {'firstname': 'Hassan',
  'lastname': 'Hassani',
  'startdate': datetime.datetime(2018, 7, 7, 0, 0),
  'enddate': datetime.datetime(2020, 11, 12, 23, 0),
  'salary': '43000'},
 {'firstname': 'Hanne',
  'lastname': 'Hansen',
  'startdate': datetime.datetime(2002, 4, 3, 0, 0),
  'enddate': None,
  'salary': '143641'},
 {'firstname': 'Jesper',
  'lastname': 'Fårekylling',
  'startdate': datetime.datetime(2002, 4, 3, 0, 0),
  'enddate': datetime.datetime(2018, 7, 6, 22, 0),
  'salary': '23000'},
 {'firstname': 'Janni',
  'lastname': 'Spiser',
  'startdate': datetime.datetime(2011, 5, 23, 0, 0),
  'enddate': None,
  'salary': '273984'},
 {'firstname': 'aa',
  'lastname': 'bb',
  'startdate': datetime.datetime(2003, 4, 4, 0, 0),
  'enddate': datetime.datetime(2003, 5, 5, 0, 0),
  'salary': '31400'},
 {'firstname': 'Helga',
  'lastname': 'Juhlborg',
  'startdate': datetime.datetime(2003, 1, 17, 0, 0),
  'enddate': datetime.datetime(2004, 4, 11, 0, 0),
  'salary': '34100'},
 {'firstname': 'Helga',
  'lastname': 'Juhlborg',
  'startdate': datetime.datetime(2003, 1, 17, 0, 0),
  'enddate': datetime.datetime(2004, 4, 11, 0, 0),
  'salary': '34100'},
 {'firstname': 'Helga',
  'lastname': 'Juhlborg',
  'startdate': datetime.datetime(2003, 1, 17, 0, 0),
  'enddate': datetime.datetime(2004, 4, 11, 0, 0),
  'salary': '34100'},
 {'firstname': 'Ulrik',
  'lastname': 'Volborg',
  'startdate': datetime.datetime(2003, 3, 3, 0, 0),
  'enddate': datetime.datetime(2005, 8, 20, 0, 0),
  'salary': '21000'},
 {'firstname': 'Ulla',
  'lastname': 'Willman',
  'startdate': datetime.datetime(2001, 5, 4, 0, 0),
  'enddate': datetime.datetime(2005, 12, 24, 0, 0),
  'salary': '32000'},
 {'firstname': 'Ulfred',
  'lastname': 'Valberg',
  'startdate': datetime.datetime(2001, 1, 4, 0, 0),
  'enddate': datetime.datetime(2006, 10, 30, 0, 0),
  'salary': '43000'},
 {'firstname': 'Helga',
  'lastname': 'Juhlborg',
  'startdate': datetime.datetime(2003, 1, 17, 0, 0),
  'enddate': datetime.datetime(2004, 4, 11, 0, 0),
  'salary': '34100'}]

## Exercise
Create a function that can take a dict and a table name and persist all values of the dict into the table columns corresponding to the dict keys.

Hint: https://dev.mysql.com/doc/connector-python/en/connector-python-example-cursor-transaction.html

In [4]:
# with pandas
import pandas as pd 
import pymysql

cnx = pymysql.connect(user='dev', password='ax2',host='127.0.0.1',port=3307,db='test') 

df = pd.read_sql('SELECT * FROM pythondemo', con=cnx)
df

    id firstname     lastname  startdate             enddate  salary
0    1     Henny     Petersen 2002-02-02 2002-02-03 23:00:00   23000
1    3    Hassan      Hassani 2018-07-07 2020-11-12 23:00:00   43000
2    4     Hanne       Hansen 2002-04-03                 NaT  143641
3    5    Jesper  Fårekylling 2002-04-03 2018-07-06 22:00:00   23000
4    6     Janni       Spiser 2011-05-23                 NaT  273984
5    7        aa           bb 2003-04-04 2003-05-05 00:00:00   31400
6    9     Helga     Juhlborg 2003-01-17 2004-04-11 00:00:00   34100
7   10     Helga     Juhlborg 2003-01-17 2004-04-11 00:00:00   34100
8   11     Helga     Juhlborg 2003-01-17 2004-04-11 00:00:00   34100
9   12     Ulrik      Volborg 2003-03-03 2005-08-20 00:00:00   21000
10  13      Ulla      Willman 2001-05-04 2005-12-24 00:00:00   32000
11  14    Ulfred      Valberg 2001-01-04 2006-10-30 00:00:00   43000
12  15     Helga     Juhlborg 2003-01-17 2004-04-11 00:00:00   34100

In [6]:
# dataframe to table
import pandas as pd 
import pymysql
from sqlalchemy import create_engine #sqlalchemy helped convert strings to dates seamlessly

#cnx = pymysql.connect(user='dev', password='ax2',host='127.0.0.1',port=3307,db='test') 
con_str = 'mysql+pymysql://dev:ax2@localhost:3307/test'
engine = create_engine(con_str)
connection = engine.raw_connection()
df = pd.DataFrame({'firstname' : ['Ulrik', 'Ulla', 'Ulfred'],
                  'lastname':['Volborg','Willman','Valberg'],
                  'startdate':['2003-03-03','2001-05-04','2001-01-04'],
                  'enddate':['2005-08-20','2005-12-24','2006-10-30'],
                  'salary':['21000', '32000', '43000']})
df = df.applymap(str)
df.to_sql('pythondemo',con=engine, if_exists='append', index = False)
df

  firstname lastname   startdate     enddate salary
0     Ulrik  Volborg  2003-03-03  2005-08-20  21000
1      Ulla  Willman  2001-05-04  2005-12-24  32000
2    Ulfred  Valberg  2001-01-04  2006-10-30  43000

## Class exercise
create a pandas dataframe from below csv and turn it into a mysql table called: 'cars'

```csv
make,model,year,price
vw,up,2018,123000
audi,a6,2011,85000
citroen,c3,2019,143000
```